Revit 2024 API
LineAndTextAttrSymbol Class
An object that represents a dimension style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class LineAndTextAttrSymbol : ElementType
Visual Basic
Public Class LineAndTextAttrSymbol _
	Inherits ElementType
Visual C++
public ref class LineAndTextAttrSymbol : public ElementType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.FilledRegionType
 Autodesk.Revit.DB.GridType
 Autodesk.Revit.DB.LevelType
 Autodesk.Revit.DB.TextElementType
See Also
LineAndTextAttrSymbol Members
Autodesk.Revit.DB Namespace